src/examples/web/examples/xml-to-url/soap-response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:orbeon="http://www.orbeon.com/">
    <env:Body>
        <orbeon:urls>
            <orbeon:error/>
            <orbeon:original-url/>
            <orbeon:tiny-url/>
        </orbeon:urls>
    </env:Body>
</env:Envelope>
